config/pen/documents/theology-understanding/gospel.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-03-14 Fri 01:43 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="root" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div class="org-src-container">
<pre class="src src-text"><span class="linenr">1: </span>The Law Maker, The LORD is not ABOVE the Law. In fact God cannot violate his Law or simply go above his Law by simply forgiving sinners. Exodus 23:7 “I will not acquit the wicked.” Yet in Romans 4:5, “He who justifies the ungodly.” So how can God forgive sinners while still being the perfectly just God He is, and not violating himself? Because Jesus FULFILLED the Law righteous demands by bearing the penalty in our stead. This is how Jesus forgave the thief on the cross. Not by being above the Law, but by bearing the laws demands on Himself!! This is the Good News!!
</pre>
</div>

<blockquote>
<p>
<b>Romans 3:20-26,31</b> - For by works of the law no human being will be justified in his sight, since through the law comes knowledge of sin. But now the righteousness of God has been manifested apart from the law, although the Law and the Prophets bear witness to it— the righteousness of God through faith in Jesus Christ for all who believe. For there is no distinction: for all have sinned and fall short of the glory of God, and are justified by his grace as a gift, through the redemption that is in Christ Jesus, whom God put forward as a propitiation by his blood, to be received by faith. This was to show God's righteousness, because in his divine forbearance he had passed over former sins. It was to show his righteousness at the present time, so that he might be just and the justifier of the one who has faith in Jesus. Do we then overthrow the law by this faith? By no means! On the contrary, we uphold the law. (ESV)
</p>
</blockquote>

<blockquote>
<p>
<b>Colossians 2:9-15</b> - For in him the whole fullness of deity dwells bodily, and you have been filled in him, who is the head of all rule and authority. In him also you were circumcised with a circumcision made without hands, by putting off the body of the flesh, by the circumcision of Christ, having been buried with him in baptism, in which you were also raised with him through faith in the powerful working of God, who raised him from the dead. <b>And you, who were dead in your trespasses and the uncircumcision of your flesh, God made alive together with him, having forgiven us all our trespasses, by canceling the record of debt that stood against us with its legal demands. This he set aside, nailing it to the cross</b>. He disarmed the rulers and authorities and put them to open shame, by triumphing over them in him. (ESV)
</p>
</blockquote>

<blockquote>
<p>
<b>Exodus 23:7</b> - Keep far from a false charge, and do not kill the innocent and righteous, for I will not acquit the wicked. (ESV)
</p>
</blockquote>

<blockquote>
<p>
<b>Matthew 12:1-8</b> - At that time Jesus went through the grainfields on the Sabbath. His disciples were hungry, and they began to pluck heads of grain and to eat. But when the Pharisees saw it, they said to him, Look, your disciples are doing what is not lawful to do on the Sabbath. He said to them, Have you not read what David did when he was hungry, and those who were with him: how he entered the house of God and ate the bread of the Presence, which it was not lawful for him to eat nor for those who were with him, but only for the priests? Or have you not read in the Law how on the Sabbath the priests in the temple profane the Sabbath and are guiltless? I tell you, something greater than the temple is here. And if you had known what this means, I desire mercy, and not sacrifice, you would not have condemned the guiltless. For the Son of Man is lord of the Sabbath. (ESV)
</p>
</blockquote>

<blockquote>
<p>
<b>Matthew 12:10-13</b> - And a man was there with a withered hand. And they asked him, Is it lawful to heal on the Sabbath?—so that they might accuse him. He said to them, Which one of you who has a sheep, if it falls into a pit on the Sabbath, will not take hold of it and lift it out? Of how much more value is a man than a sheep! So it is lawful to do good on the Sabbath. Then he said to the man, Stretch out your hand. And the man stretched it out, and it was restored, healthy like the other. (ESV)
</p>
</blockquote>
</div>
<div id="postamble" class="status">
<p class="author">Author: root</p>
<p class="date">Created: 2025-03-14 Fri 01:43</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
